app/Controllers/Admin/Auth.php

SELECT *
FROM `admins`
WHERE `email` = 'admin@example.com'
 LIMIT 1
---
    public function attempt()
    {
        if (! $this->validate(['email' => 'required|valid_email', 'password' => 'required'])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }
        $admin = (new AdminModel())->where('email', $this->request->getPost('email'))->first();