app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `orders`
SELECT SUM(`total`) AS `total`
FROM `orders`
WHERE `payment_status` = 'paid'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `products`
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `enquiries`
WHERE `is_read` = 0
SELECT COUNT(*) AS `numrows`
FROM `contacts`
WHERE `is_read` = 0
SELECT *
FROM `orders`
ORDER BY `id` DESC
 LIMIT 6
SELECT *
FROM `products`
WHERE `stock` < 6
ORDER BY `stock`
 LIMIT 5
---
    public function index()
    {
        $orders = new OrderModel();

        // Orders + revenue for the last 7 days
        $labels = $counts = $revenue = [];
        for ($i = 6; $i >= 0; $i--) {
            $d        = date('Y-m-d', strtotime("-$i day"));
            $labels[] = date('d M', strtotime($d));
            $row      = db_connect()->query(
                "SELECT COUNT(*) c, COALESCE(SUM(CASE WHEN payment_status='paid' THEN total END),0) r FROM orders WHERE DATE(created_at) = ?",
                [$d]
            )->getRowArray();
            $counts[]  = (int) $row['c'];
            $revenue[] = (float) $row['r'];
        }

        return $this->render('dashboard', [
            'title'    => 'Dashboard',
            'stats'    => [
                'orders'    => $orders->countAllResults(),
                'revenue'   => (float) ($orders->selectSum('total')->where('payment_status', 'paid')->first()['total'] ?? 0),
                'products'  => (new ProductModel())->countAllResults(),
                'users'     => (new UserModel())->countAllResults(),
                'enquiries' => (new EnquiryModel())->where('is_read', 0)->countAllResults(),
                'contacts'  => (new ContactModel())->where('is_read', 0)->countAllResults(),
            ],
            'recent'   => $orders->orderBy('id', 'DESC')->findAll(6),
            'lowStock' => (new ProductModel())->where('stock <', 6)->orderBy('stock')->findAll(5),
            'chart'    => ['labels' => $labels, 'orders' => $counts, 'revenue' => $revenue],
        ]);