app/Views/admin/layout.php

SELECT COUNT(*) AS `numrows`
FROM `enquiries`
WHERE `is_read` = 0
SELECT COUNT(*) AS `numrows`
FROM `contacts`
WHERE `is_read` = 0
---
</head>
<body>
<?php
  $unreadEnq = (new \App\Models\EnquiryModel())->where('is_read', 0)->countAllResults();
  $unreadCon = (new \App\Models\ContactModel())->where('is_read', 0)->countAllResults();