app/Helpers/shop_helper.php

    function nav_categories(): array
    {
        return (new \App\Models\CategoryModel())->where('status', 1)->orderBy('name')->findAll();
---
SELECT *
FROM `categories`
WHERE `status` = 1
ORDER BY `name`