app/Controllers/Website/Home.php

    public function index()
    {
        return view('website/pages/home', [
            'title'      => 'Home',
            'banners'    => (new BannerModel())->where('status', 1)->orderBy('sort_order')->findAll(),
            'categories' => (new CategoryModel())->where('status', 1)->findAll(),
            'featured'   => (new ProductModel())->where(['status' => 1, 'featured' => 1])->orderBy('id', 'DESC')->findAll(8),
            'latest'     => (new ProductModel())->where('status', 1)->orderBy('id', 'DESC')->findAll(4),
---
SELECT *
FROM `banners`
WHERE `status` = 1
ORDER BY `sort_order`
SELECT *
FROM `categories`
WHERE `status` = 1
SELECT *
FROM `products`
WHERE `status` = 1
AND `featured` = 1
ORDER BY `id` DESC
 LIMIT 8
SELECT *
FROM `products`
WHERE `status` = 1
ORDER BY `id` DESC
 LIMIT 4