app/Controllers/Website/Shop.php

            'title'      => 'Shop',
            'products'   => $model->paginate(9),
            'pager'      => $model->pager,
            'categories' => $cats->where('status', 1)->findAll(),
---
SELECT *
FROM `categories`
WHERE `status` = 1